женщина(мама).
мужчина(папа).
мужчина(дед).
мужчина(сын).
родитель(мама,сын).
родитель(папа,сын).
женщина(дочь).
родитель(мама,дочь).
родитель(папа,дочь).
родитель(дед,папа).

% Требуются отношения:
является_матерью(X) :- женщина(X), родитель(X,Y).
является_отцом(X) :- мужчина(X), родитель(X,Y).
является_сыном(X) :- мужчина(X), родитель(Y,X).
общие_родители(X,Y) :- родитель(Z,X),родитель(Z,Y).
дедушка(X,Y) :- мужчина(X), родитель(X,Z), родитель(Z,Y).
является_сестрой(X,Y) :- женщина(X), общие_родители(X,Y). 
